Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: أم حسبتم أن تتركوا ولما يعلم الله الذين جاهدوا منكم ولم يتخذوا من دون الله ولا رسوله ولا المؤمنين وليجة والله خبير بما تعملون
en: Do you think that you shall be left alone while Allah has not yet tested those among you who have striven hard and fought and have not taken Walijah [(Bitanah - helpers, advisors and consultants from disbelievers, pagans.) giving openly to them their secrets] besides Allah, and His Messenger, and the believers. Allah is Well-Acquainted with what you do.

source: ما كان للمشركين أن يعمروا مساجد الله شاهدين على أنفسهم بالكفر أولئك حبطت أعمالهم وفي النار هم خالدون
en: It is not for the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah), to maintain the Mosques of Allah (i.e. to pray and worship Allah therein, to look after their cleanliness and their building,), while they witness against their ownselves of disbelief. The works of such are in vain and in Fire shall they abide.

source: إنما يعمر مساجد الله من آمن بالله واليوم الآخر وأقام الصلاة وآتى الزكاة ولم يخش إلا الله فعسى أولئك أن يكونوا من المهتدين
en: The Mosques of Allah shall be maintained only by those who believe in Allah and the Last Day, perform As-Salat (Iqamat-as-Salat), and give Zakat and fear none but Allah. It is they who are on true guidance.

source: أجعلتم سقاية الحاج وعمارة المسجد الحرام كمن آمن بالله واليوم الآخر وجاهد في سبيل الله لا يستوون عند الله والله لا يهدي القوم الظالمين
en: Do you consider the providing of drinking water to the pilgrims and the maintenance of Al-Masjidal-Haram (at Makkah) as equal to the worth of those who believe in Allah and the Last Day, and strive hard and fight in the Cause of Allah? They are not equal before Allah. And Allah guides not those people who are the Zalimun (polytheists and wrong-doers).

source: الذين آمنوا وهاجروا وجاهدوا في سبيل الله بأموالهم وأنفسهم أعظم درجة عند الله وأولئك هم الفائزون
en: Those who believed (in the Oneness of Allah - Islamic Monotheism) and emigrated and strove hard and fought in Allah's Cause with their wealth and their lives are far higher in degree with Allah. They are the successful.

source: يبشرهم ربهم برحمة منه ورضوان وجنات لهم فيها نعيم مقيم
en: Their Lord gives them glad tidings of Mercy from Him, and His being pleased (with them), and of Gardens (Paradise) for them wherein are everlasting delights.

source: خالدين فيها أبدا إن الله عنده أجر عظيم
en: They will dwell therein forever. Verily, with Allah is a great reward.

source: يا أيها الذين آمنوا لا تتخذوا آباءكم وإخوانكم أولياء إن استحبوا الكفر على الإيمان ومن يتولهم منكم فأولئك هم الظالمون
en: O you who believe! Take not as Auliya' (supporters and helpers) your fathers and your brothers if they prefer disbelief to Belief. And whoever of you does so, then he is one of the Zalimun (wrong-doers).

source: قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم وأموال اقترفتموها وتجارة تخشون كسادها ومساكن ترضونها أحب إليكم من الله ورسوله وجهاد في سبيله فتربصوا حتى يأتي الله بأمره والله لا يهدي القوم الفاسقين
en: Say: If your fathers, your sons, your brothers, your wives, your kindred, the wealth that you have gained, the commerce in which you fear a decline, and the dwellings in which you delight are dearer to you than Allah and His Messenger, and striving hard and fighting in His Cause, then wait until Allah brings about His Decision (torment). And Allah guides not the people who are Al-Fasiqun (the rebellious, disobedient to Allah).

source: لقد نصركم الله في مواطن كثيرة ويوم حنين إذ أعجبتكم كثرتكم فلم تغن عنكم شيئا وضاقت عليكم الأرض بما رحبت ثم وليتم مدبرين
en: Truly Allah has given you victory on many battle fields, and on the Day of Hunain (battle) when you rejoiced at your great number, but it availed you naught and the earth, vast as it is, was straitened for you, then you turned back in flight.

source: ثم أنزل الله سكينته على رسوله وعلى المؤمنين وأنزل جنودا لم تروها وعذب الذين كفروا وذلك جزاء الكافرين
en: Then Allah did send down His Sakinah (calmness, tranquillity and reassurance) on the Messenger (Muhammad صلى الله عليه وسلم), and on the believers, and sent down forces (angels) which you saw not, and punished the disbelievers. Such is the recompense of disbelievers.

source: ثم يتوب الله من بعد ذلك على من يشاء والله غفور رحيم
en: Then after that Allah will accept the repentance of whom He wills. And Allah is Oft-Forgiving, Most Merciful.

source: يا أيها الذين آمنوا إنما المشركون نجس فلا يقربوا المسجد الحرام بعد عامهم هذا وإن خفتم عيلة فسوف يغنيكم الله من فضله إن شاء إن الله عليم حكيم
en: O you who believe (in Allah's Oneness and in His Messenger Muhammad صلى الله عليه وسلم)! Verily, the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah, and in the Message of Muhammad صلى الله عليه وسلم) are Najasun (impure). So let them not come near Al-Masjidal-Haram (at Makkah) after this year; and if you fear poverty, Allah will enrich you if He wills, out of His Bounty. Surely, Allah is All-Knowing, All-Wise.

source: قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون
en: Fight against those who (1) believe not in Allah, (2) nor in the Last Day, (3) nor forbid that which has been forbidden by Allah and His Messenger Muhammad (صلى الله عليه وسلم) (4) and those who acknowledge not the religion of truth (i.e. Islam) among the people of the Scripture (Jews and Christians), until they pay the Jizyah with willing submission, and feel themselves subdued.

source: وقالت اليهود عزير ابن الله وقالت النصارى المسيح ابن الله ذلك قولهم بأفواههم يضاهئون قول الذين كفروا من قبل قاتلهم الله أنى يؤفكون
en: And the Jews say: 'Uzair (Ezra) is the son of Allah, and the Christians say: Messiah is the son of Allah. That is their saying with their mouths, resembling the saying of those who disbelieved aforetime. Allah's Curse be on them, how they are deluded away from the truth!

source: اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم وما أمروا إلا ليعبدوا إلها واحدا لا إله إلا هو سبحانه عما يشركون
en: They (Jews and Christians) took their rabbis and their monks to be their lords besides Allah (by obeying them in things which they made lawful or unlawful according to their own desires without being ordered by Allah), and (they also took as their Lord) Messiah, son of Maryam (Mary), while they (Jews and Christians) were commanded [in the Taurat (Torah) and the Injeel (Gospel)] to worship none but One Ilah (God - Allah) La ilaha illa Huwa (none has the right to be worshipped but He) . Praise and glory be to Him (far above is He) from having the partners they associate (with Him)."

source: يريدون أن يطفئوا نور الله بأفواههم ويأبى الله إلا أن يتم نوره ولو كره الكافرون
en: They (the disbelievers, the Jews and the Christians) want to extinguish Allah's Light (with which Muhammad صلى الله عليه وسلم has been sent - Islamic Monotheism) with their mouths, but Allah will not allow except that His Light should be perfected even though the Kafirun (disbelievers) hate (it).

source: هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون
en: It is He Who has sent His Messenger (Muhammad صلى الله عليه وسلم) with guidance and the religion of truth (Islam), to make it superior over all religions even though the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah) hate (it).

source: يا أيها الذين آمنوا إن كثيرا من الأحبار والرهبان ليأكلون أموال الناس بالباطل ويصدون عن سبيل الله والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله فبشرهم بعذاب أليم
en: O you who believe! Verily, there are many of the (Jewish) rabbis and the (Christian) monks who devour the wealth of mankind in falsehood, and hinder (them) from the Way of Allah (i.e. Allah's religion of Islamic Monotheism). And those who hoard up gold and silver [Al-Kanz: the money, the Zakat of which has not been paid] and spend them not in the Way of Allah, announce unto them a painful torment.

source: يوم يحمى عليها في نار جهنم فتكوى بها جباههم وجنوبهم وظهورهم هذا ما كنزتم لأنفسكم فذوقوا ما كنتم تكنزون
en: On the Day when that (Al-Kanz: money, gold and silver the Zakat of which has not been paid) will be heated in the Fire of Hell and with it will be branded their foreheads, their flanks, and their backs, (and it will be said unto them): "This is the treasure which you hoarded for yourselves. Now taste of what you used to hoard."

source: إن عدة الشهور عند الله اثنا عشر شهرا في كتاب الله يوم خلق السماوات والأرض منها أربعة حرم ذلك الدين القيم فلا تظلموا فيهن أنفسكم وقاتلوا المشركين كافة كما يقاتلونكم كافة واعلموا أن الله مع المتقين
en: Verily, the number of months with Allah is twelve months (in a year), so was it ordained by Allah on the Day when He created the heavens and the earth; of them four are Sacred (i.e. the 1st, the 7th, the 11th and the 12th months of the Islamic calendar). That is the right religion, so wrong not yourselves therein, and fight against the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah) collectively as they fight against you collectively. But know that Allah is with those who are Al-Muttaqun (the pious - See V.2:2).

source: إنما النسيء زيادة في الكفر يضل به الذين كفروا يحلونه عاما ويحرمونه عاما ليواطئوا عدة ما حرم الله فيحلوا ما حرم الله زين لهم سوء أعمالهم والله لا يهدي القوم الكافرين
en: The postponing (of a Sacred Month) is indeed an addition to disbelief: thereby the disbelievers are led astray, for they make it lawful one year and forbid it another year in order to adjust the number of months forbidden by Allah, and make such forbidden ones lawful. The evil of their deeds is made fair-seeming to them. And Allah guides not the people who disbelieve.

source: يا أيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله اثاقلتم إلى الأرض أرضيتم بالحياة الدنيا من الآخرة فما متاع الحياة الدنيا في الآخرة إلا قليل
en: O you who believe! What is the matter with you, that when you are asked to march forth in the Cause of Allah (i.e. Jihad) you cling heavily to the earth? Are you pleased with the life of this world rather than the Hereafter? But little is the enjoyment of the life of this world as compared to the Hereafter.

source: إلا تنفروا يعذبكم عذابا أليما ويستبدل قوما غيركم ولا تضروه شيئا والله على كل شيء قدير
en: If you march not forth, He will punish you with a painful torment and will replace you by another people; and you cannot harm Him at all, and Allah is Able to do all things.

source: إلا تنصروه فقد نصره الله إذ أخرجه الذين كفروا ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا فأنزل الله سكينته عليه وأيده بجنود لم تروها وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا والله عزيز حكيم
en: If you help him (Muhammad صلى الله عليه وسلم) not (it does not matter), for Allah did indeed help him when the disbelievers drove him out, the second of the two; when they (Muhammad صلى الله عليه وسلم and Abu Bakr رضي الله عنه) were in the cave, he (صلى الله عليه وسلم) said to his companion (Abu Bakr رضي الله عنه): "Be not sad (or afraid), surely Allah is with us." Then Allah sent down His Sakinah (calmness, tranquillity, peace) upon him, and strengthened him with forces (angels) which you saw not, and made the word of those who disbelieved the lowermost, while the Word of Allah that became the uppermost; and Allah is All-Mighty, All-Wise.

source: انفروا خفافا وثقالا وجاهدوا بأموالكم وأنفسكم في سبيل الله ذلكم خير لكم إن كنتم تعلمون
en: March forth, whether you are light (being healthy, young and wealthy) or heavy (being ill, old and poor), and strive hard with your wealth and your lives in the Cause of Allah. This is better for you, if you but knew.

source: لو كان عرضا قريبا وسفرا قاصدا لاتبعوك ولكن بعدت عليهم الشقة وسيحلفون بالله لو استطعنا لخرجنا معكم يهلكون أنفسهم والله يعلم إنهم لكاذبون
en: Had it been a near gain (booty in front of them) and an easy journey, they would have followed you, but the distance (Tabuk expedition) was long for them; and they would swear by Allah, "If we only could, we would certainly have come forth with you." They destroy their ownselves, and Allah knows that they are liars.

source: عفا الله عنك لم أذنت لهم حتى يتبين لك الذين صدقوا وتعلم الكاذبين
en: May Allah forgive you (O Muhammad صلى الله عليه وسلم). Why did you grant them leave (for remaining behind; you should have persisted as regards your order to them to proceed on Jihad ), until those who told the truth were seen by you in a clear light, and you had known the liars?

source: لا يستأذنك الذين يؤمنون بالله واليوم الآخر أن يجاهدوا بأموالهم وأنفسهم والله عليم بالمتقين
en: Those who believe in Allah and the Last Day would not ask your leave to be exempted from fighting with their properties and their lives; and Allah is the All-Knower of Al-Muttaqun (the pious - See V.2:2).

source: إنما يستأذنك الذين لا يؤمنون بالله واليوم الآخر وارتابت قلوبهم فهم في ريبهم يترددون
en: It is only those who believe not in Allah and the Last Day and whose hearts are in doubt that ask your leave (to be exempted from Jihad). So in their doubts they waver.

source: ولو أرادوا الخروج لأعدوا له عدة ولكن كره الله انبعاثهم فثبطهم وقيل اقعدوا مع القاعدين
en: And if they had intended to march out, certainly, they would have made some preparation for it; but Allah was averse to their being sent forth, so He made them lag behind, and it was said (to them), "Sit you among those who sit (at home)."

source: لو خرجوا فيكم ما زادوكم إلا خبالا ولأوضعوا خلالكم يبغونكم الفتنة وفيكم سماعون لهم والله عليم بالظالمين
en: Had they marched out with you, they would have added to you nothing except disorder, and they would have hurried about in your midst (spreading corruption) and sowing sedition among you - and there are some among you who would have listened to them. And Allah is the All-Knower of the Zalimun (polytheists and wrong-doers).

source: لقد ابتغوا الفتنة من قبل وقلبوا لك الأمور حتى جاء الحق وظهر أمر الله وهم كارهون
en: Verily, they had plotted sedition before, and had upset matters for you, until the truth (victory) came and the Decree of Allah (His religion, Islam) became manifest though they hated it.

source: ومنهم من يقول ائذن لي ولا تفتني ألا في الفتنة سقطوا وإن جهنم لمحيطة بالكافرين
en: And among them is he who says: "Grant me leave (to be exempted from Jihad) and put me not into trial." Surely, they have fallen into trial. And verily, Hell is surrounding the disbelievers.

source: إن تصبك حسنة تسؤهم وإن تصبك مصيبة يقولوا قد أخذنا أمرنا من قبل ويتولوا وهم فرحون
en: If good befalls you (O Muhammad صلى الله عليه وسلم), it grieves them, but if a calamity overtakes you, they say: "We took our precaution beforehand" and they turn away rejoicing.

source: قل لن يصيبنا إلا ما كتب الله لنا هو مولانا وعلى الله فليتوكل المؤمنون
en: Say: "Nothing shall ever happen to us except what Allah has ordained for us. He is our Maula (Lord, Helper and Protector)." And in Allah let the believers put their trust.

source: قل هل تربصون بنا إلا إحدى الحسنيين ونحن نتربص بكم أن يصيبكم الله بعذاب من عنده أو بأيدينا فتربصوا إنا معكم متربصون
en: Say: "Do you wait for us (anything) except one of the two best things (martyrdom or victory); while we await for you either that Allah will afflict you with a punishment from Himself or at our hands. So wait, we too are waiting with you."

source: قل أنفقوا طوعا أو كرها لن يتقبل منكم إنكم كنتم قوما فاسقين
en: Say: "Spend (in Allah's Cause) willingly or unwillingly, it will not be accepted from you. Verily, you are ever a people who are Fasiqun (rebellious, disobedient to Allah)."

source: وما منعهم أن تقبل منهم نفقاتهم إلا أنهم كفروا بالله وبرسوله ولا يأتون الصلاة إلا وهم كسالى ولا ينفقون إلا وهم كارهون
en: And nothing prevents their contributions from being accepted from them except that they disbelieved in Allah and in His Messenger (Muhammad صلى الله عليه وسلم), and that they came not to As-Salat (the prayer) except in a lazy state, and that they offer not contributions but unwillingly.

source: فلا تعجبك أموالهم ولا أولادهم إنما يريد الله ليعذبهم بها في الحياة الدنيا وتزهق أنفسهم وهم كافرون
en: So let not their wealth nor their children amaze you (O Muhammad صلى الله عليه وسلم); in reality Allah's Plan is to punish them with these things in the life of this world, and that their souls shall depart (die) while they are disbelievers.

source: ويحلفون بالله إنهم لمنكم وما هم منكم ولكنهم قوم يفرقون
en: They swear by Allah that they are truly of you while they are not of you, but they are a people (hypocrites) who are afraid (that you may kill them).

source: لو يجدون ملجأ أو مغارات أو مدخلا لولوا إليه وهم يجمحون
en: Should they find a refuge, or caves, or a place of concealment, they would turn straightway thereto with a swift rush.

source: ومنهم من يلمزك في الصدقات فإن أعطوا منها رضوا وإن لم يعطوا منها إذا هم يسخطون
en: And of them are some who accuse you (O Muhammad صلى الله عليه وسلم) in the matter of (the distribution of) the alms. If they are given part thereof, they are pleased, but if they are not given thereof, behold! They are enraged!

source: ولو أنهم رضوا ما آتاهم الله ورسوله وقالوا حسبنا الله سيؤتينا الله من فضله ورسوله إنا إلى الله راغبون
en: Would that they were contented with what Allah and His Messenger (صلى الله عليه وسلم) gave them and had said: "Allah is Sufficient for us. Allah will give us of His Bounty, and so will His Messenger (from alms). We implore Allah (to enrich us)."

source: إنما الصدقات للفقراء والمساكين والعاملين عليها والمؤلفة قلوبهم وفي الرقاب والغارمين وفي سبيل الله وابن السبيل فريضة من الله والله عليم حكيم
en: As-Sadaqat (here it means Zakat ) are only for the Fuqara' (poor), and Al-Masakin (the poor) and those employed to collect (the funds), and to attract the hearts of those who have been inclined (towards Islam), and to free the captives, and for those in debt, and for Allah's Cause (i.e. for Mujahidun - those fighting in a holy battle), and for the wayfarer (a traveller who is cut off from everything); a duty imposed by Allah. And Allah is All-Knower, All-Wise.

source: ومنهم الذين يؤذون النبي ويقولون هو أذن قل أذن خير لكم يؤمن بالله ويؤمن للمؤمنين ورحمة للذين آمنوا منكم والذين يؤذون رسول الله لهم عذاب أليم
en: And among them are men who annoy the Prophet (Muhammad صلى الله عليه وسلم) and say: "He is (lending his) ear (to every news)." Say: "He listens to what is best for you; he believes in Allah, has faith in the believers, and is a mercy to those of you who believe." But those who annoy Allah's Messenger (Muhammad صلى الله عليه وسلم) will have a painful torment. [See V.33:57]

source: يحلفون بالله لكم ليرضوكم والله ورسوله أحق أن يرضوه إن كانوا مؤمنين
en: They swear by Allah to you (Muslims) in order to please you, but it is more fitting that they should please Allah and His Messenger (Muhammad صلى الله عليه وسلم), if they are believers.

source: ألم يعلموا أنه من يحادد الله ورسوله فأن له نار جهنم خالدا فيها ذلك الخزي العظيم
en: Know they not that whoever opposes and shows hostility to Allah (عز وجل) and His Messenger(صلى الله عليه وسلم), certainly for him will be the Fire of Hell to abide therein. That is the extreme disgrace.

source: يحذر المنافقون أن تنزل عليهم سورة تنبئهم بما في قلوبهم قل استهزئوا إن الله مخرج ما تحذرون
en: The hypocrites fear lest a Surah (chapter of the Qur'an) should be revealed about them, showing them what is in their hearts. Say: "(Go ahead and) mock! But certainly Allah will bring to light all that you fear."

source: ولئن سألتهم ليقولن إنما كنا نخوض ونلعب قل أبالله وآياته ورسوله كنتم تستهزئون
en: If you ask them (about this), they declare: "We were only talking idly and joking." Say: "Was it at Allah (عز وجل), and His Ayat (proofs, evidence, verses, lessons, signs, revelations) and His Messenger (صلى الله عليه وسلم) that you were mocking?"

source: لا تعتذروا قد كفرتم بعد إيمانكم إن نعف عن طائفة منكم نعذب طائفة بأنهم كانوا مجرمين
en: Make no excuse; you disbelieved after you had believed. If We pardon some of you, We will punish others amongst you because they were Mujrimun (disbelievers, polytheists, sinners, criminals.).

source: المنافقون والمنافقات بعضهم من بعض يأمرون بالمنكر وينهون عن المعروف ويقبضون أيديهم نسوا الله فنسيهم إن المنافقين هم الفاسقون
en: The hypocrites, men and women, are one from another; they enjoin (on the people) Al-Munkar (i.e. disbelief and polytheism of all kinds and all that Islam has forbidden), and forbid (people) from Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do), and they close their hands [from giving (spending in Allah's Cause) alms]. They have forgotten Allah, so He has forgotten them. Verily, the hypocrites are the Fasiqun (rebellious, disobedient to Allah).

source: وعد الله المنافقين والمنافقات والكفار نار جهنم خالدين فيها هي حسبهم ولعنهم الله ولهم عذاب مقيم
en: Allah has promised the hypocrites - men and women - and the disbelievers, the Fire of Hell; therein shall they abide. It will suffice them. Allah has cursed them and for them is the lasting torment.

source: كالذين من قبلكم كانوا أشد منكم قوة وأكثر أموالا وأولادا فاستمتعوا بخلاقهم فاستمتعتم بخلاقكم كما استمتع الذين من قبلكم بخلاقهم وخضتم كالذي خاضوا أولئك حبطت أعمالهم في الدنيا والآخرة وأولئك هم الخاسرون
en: Like those before you: they were mightier than you in power, and more abundant in wealth and children. They had enjoyed their portion (awhile), so enjoy your portion (awhile) as those before you enjoyed their portion (awhile); and you indulged in play and pastime (and in telling lies against Allah and His Messenger Muhammad صلى الله عليه وسلم) as they indulged in play and pastime. Such are they whose deeds are in vain in this world and in the Hereafter. Such are they who are the losers.

source: ألم يأتهم نبأ الذين من قبلهم قوم نوح وعاد وثمود وقوم إبراهيم وأصحاب مدين والمؤتفكات أتتهم رسلهم بالبينات فما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: Has not the story reached them of those before them? - The people of Nuh (Noah), 'Ad, and Thamud, the people of Ibrahim (Abraham), the dwellers of Madyan (Midian) and the cities overthrown [i.e. the people to whom Lut (Lot) preached]; to them came their Messengers with clear proofs. So it was not Allah Who wronged them, but they used to wrong themselves.

source: والمؤمنون والمؤمنات بعضهم أولياء بعض يأمرون بالمعروف وينهون عن المنكر ويقيمون الصلاة ويؤتون الزكاة ويطيعون الله ورسوله أولئك سيرحمهم الله إن الله عزيز حكيم
en: The believers, men and women, are Auliya' (helpers, supporters, friends, protectors) of one another; they enjoin (on the people) Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam orders one to do), and forbid (people) from Al-Munkar (i.e. polytheism and disbelief of all kinds, and all that Islam has forbidden); they perform As-Salat (Iqamat-as-Salat), and give the Zakat, and obey Allah and His Messenger. Allah will have His Mercy on them. Surely Allah is All-Mighty, All-Wise.

source: وعد الله المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ومساكن طيبة في جنات عدن ورضوان من الله أكبر ذلك هو الفوز العظيم
en: Allah has promised the believers - men and women, - Gardens under which rivers flow to dwell therein forever, and beautiful mansions in Gardens of 'Adn (Eden Paradise). But the greatest bliss is the Good Pleasure of Allah. That is the supreme success.

source: يا أيها النبي جاهد الكفار والمنافقين واغلظ عليهم ومأواهم جهنم وبئس المصير
en: O Prophet (Muhammad صلى الله عليه وسلم)! Strive hard against the disbelievers and the hypocrites, and be harsh against them, their abode is Hell, - and worst indeed is that destination.
